tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "fzf"
brew "vim"
brew "git"
brew "htop"
brew "mas"
# brew "1password-cli"
brew "bat"
brew "eza"
brew "fd"
brew "gh"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zoxide"
brew "neovim"
brew "neofetch"
brew "lazygit"
brew "fastfetch"
brew "go"
brew "jenv"
brew "kanata"
brew "lima"
brew "maven"
brew "node"
brew "pandoc"
brew "pyenv"
brew "stow"
brew "yazi"
brew "postgresql@16"
# brew "wireshark"
brew "lima-additional-guestagents"
# brew "poetry"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cmake"
brew "nasm"
brew "ninja"
brew "pkg-config"
brew "llvm@20"
brew "qt"

cask "zen"
cask "zed"
cask "visual-studio-code"
# cask "wezterm"
cask "1password"
cask "raycast"
cask "alt-tab"
# cask "cleanshot"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "iina"
cask "obsidian"
cask "the-unarchiver"
cask "airbuddy"
cask "aldente"
cask "balenaetcher"
cask "bartender"
cask "chatgpt"
cask "claude"
cask "cleanmymac"
cask "discord"
cask "itsycal"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "linearmouse"
cask "mediamate"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "monitorcontrol"
cask "obs"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "signal"
cask "spotify"
cask "utm"
cask "wireshark-app"
cask "oracle-jdk@21"
cask "oracle-jdk"
cask "github"
# cask "hyperkey"
cask "lm-studio"
cask "karabiner-elements"
cask "dotnet-sdk"
cask "corretto@21"
cask "ghostty"
